# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

"""num = int(input('Введите трехзначное число: '))
num1 = num % 10
num = num // 10
num2 = num % 10
num = num // 10
print("Сумма цифр трехзначного числа:", num + num1 + num2)"""
num = input('Введите трехзначное число: ')
sum = int(num[0]) + int(num[1]) + int(num[2])
print("Сумма цифр трехзначного числа:", sum)