# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

x = int(input('Введите сумму задуманных чисел: '))
y = int(input('Введите произведение задуманных чисел: '))
z = 0
for sum in range(x + y):
    if z:
        break
    for mult in range(x + y):
        if sum + mult == x and sum * mult == y:
            z = 1
            print('Задуманные числа: ', *sorted([sum, mult]))
            break