# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть

coin = int(input('Введите количество монеток: '))
coup = 0
for i in range(coin):
    side = int(input('Введите сторону монеты (0 - орел, 1 - решка): '))
    if side == 1:
        coup += 1
print('Минимальное количество монет нужно перевернуть: ', coup if coup<coin/2 else coin-coup)